///*scanf的高级用法*/
//#include <stdio.h>
//
//int main()
//{
//	//int a;
//
///* *号读取并丢掉读取字符的原理,就是利用scanf中使用不简单的控制字符,在缓存区中的特性*/
//	//scanf("*%d", &a);
//
//	//printf("%d", a);
//
///*1. scanf可以控制输入字符大小(用数字限定)*/
//
///*2. scanf可以匹配特定的字符，使用%[xxx],[]括起来的是需要读取的字符集合,中途遇到其它字符的就结束输入,
//[]内部可以写任何字符*/
//	char ch[15]; 
//	//scanf("%[abcd]",ch); /*表示只匹配abcd四个字符,并且可以打乱顺序,遇到别的字符就输入失败,*/
//	//printf("%s", ch);
//
//	//scanf("%[a-z]", ch); /*可以使用连字符-,来确定一个读取的范围,当然也可以打乱顺序,读到范围以外的字符就输入
//	                     //失败, 此次为读取a-z的范围*/
//	//printf("%s", ch);
//
//	//scanf("%[0-9]", ch); /*此次为读取十进制数,0-9的范围*/
//	//printf("%s", ch);
//
//	//scanf("%[0-9a-zA-Z]",ch); /*可以结合使用,表示读取0-9,a-z,A-Z所有范围内的字符*/
//	//printf("%s", ch);
//
///*scanf还可以指定不匹配那些字符 %[^指定不匹配的字符],[]内部可以写任何字符*/
//	//scanf("%[^0-9]", ch); /*读取除0-9之外的所有字符,包括空白字符,此时当你输入0-9shi才会结束输入*/
//	//printf("%s", ch);
//
//	//scanf("%[^\n]", ch); /*读取除了换行符之外的所有字符,输入换行符结束输入*/
//	//printf("%s", ch);
//
///*3.scanf用于丢弃相应读取到的字符*/
//	//scanf("%*d", ch); /*读取缓存区的整数并且丢弃*/
//	//scanf("%*[1-9]", ch); /*读取1-9的字符并且丢弃*/
//	//scanf("%*[a-z]", ch); /*读取a-z并且丢弃*/
//	//scanf("%*[^\n]", ch); /*读取除\n之外的字符全部都丢弃*/
//}