///*利用循环和选择结构输出一个简单的菱形*/
///*还是使用之前打印金字塔的思想,
//* 1.使用一个循环遍历需要打印的行数,内部再嵌套三个循环分别打印相应数据
//  2. 使用三个循环: 第一个打印空格
//                   第二个打印上边数据
//                   第三行打印下边数据
//  3.通过定义函数实现*/
//#include <stdio.h>
//
//void LxOutput(int n) /*输入打印行数*/
//{
//    /*从1开始因为直观来看的话,第一行用1来标识*/
//    for (int i = 1; i < 2*n; i++)  /*因为需要打印的是一个菱形,有上中下三个部分,2*n-1表示的是总行数*/
//    {
//        int j;
//        /*每一行先判断是否需要打印空格*/
//        for (j = 0;  j < n-i && i <= n; j++)
//        {
//            printf(" ");
//        }
//
//        /*打印上面部分*/
//        for (j = 0; j < i && i <= n ; j++)
//        {
//            printf("* "); /*利用空格来实现对齐*/
//        }
//
//        /*打印下面部分的空格*/
//        for (j = 0; j < i-n && i > n; j++)
//        {
//            printf(" ");
//        }
//
//        /*打印下面部分*/
//        for (j = 0;j <  2*n -i && i > n; j++) /*此处只要将上面的输出倒过来就行了*/
//        {
//            printf("* ");
//        }
//        printf("\n");
//    }
//
//}
//
//int main()
//{
//    LxOutput(5); /*输出菱形*/
//
//    return 0;
//}